In [25]:
import pandas as pd
import matplotlib.pyplot as plt
import statsmodels.api as sm

# Data Preprocessing

In [26]:
df = pd.read_csv('files/general_data.csv', parse_dates=['Data'], index_col='Data')
df = df.rename_axis('Date')
df.rename(columns={'Osoby': 'Unemployed'}, inplace=True)
df

            Unemployed
Date
2011-01-01     2104986
2011-02-01     2150233
2011-03-01     2133916
2011-04-01     2043516
2011-05-01     1962587
...                ...
2023-09-01      775987
2023-10-01      770446
2023-11-01      773403
2023-12-01      788229
2024-01-01      837063

[157 rows x 1 columns]

In [27]:
import yfinance as yf

# Symbol dla złota na Yahoo Finance to "GC=F"
symbol = 'GC=F'

# Pobranie danych historycznych z ostatnich 10 lat
gold = yf.download(symbol, start='2010-12-30', end='2024-03-25')
gold.head()

[*********************100%%**********************]  1 of 1 completed

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2010-12-30,1413.800049,1413.800049,1403.099976,1405.599976,1405.599976,185
2010-12-31,1405.699951,1421.099976,1405.699951,1421.099976,1421.099976,54
2011-01-03,1415.599976,1423.900024,1413.699951,1422.599976,1422.599976,28
2011-01-04,1409.599976,1410.900024,1375.800049,1378.500000,1378.500000,122
2011-01-05,1383.400024,1384.000000,1364.199951,1373.400024,1373.400024,175

In [28]:
gold_day1 = gold.loc[gold.index.day == 1]
gold_day1.head()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2011-02-01,1333.099976,1342.900024,1325.300049,1339.599976,1339.599976,3180
2011-03-01,1415.300049,1434.400024,1415.300049,1430.699951,1430.699951,116
2011-04-01,1433.400024,1436.500000,1413.000000,1428.099976,1428.099976,5318
2011-06-01,1535.699951,1550.599976,1529.699951,1542.400024,1542.400024,2845
2011-07-01,1502.199951,1502.199951,1480.000000,1482.300049,1482.300049,66

In [29]:
combined = pd.concat([df, gold_day1['Close']], axis=1)
combined

            Unemployed        Close
Date
2011-01-01   2104986.0          NaN
2011-02-01   2150233.0  1339.599976
2011-03-01   2133916.0  1430.699951
2011-04-01   2043516.0  1428.099976
2011-05-01   1962587.0          NaN
...                ...          ...
2023-11-01    773403.0  1978.800049
2023-12-01    788229.0  2071.000000
2024-01-01    837063.0          NaN
2024-02-01         NaN  2053.000000
2024-03-01         NaN  2086.899902

[159 rows x 2 columns]

In [30]:
usd_pln = pd.read_excel('files/USD_PLN.xlsx', sheet_name = 0, parse_dates=['Data'], index_col='Data')
usd_pln.head()

            Ostatnio  Otwarcie    Max.    Min.  Wol.  Zmiana%
Data
2024-02-29    3.9910    3.9856  4.0025  3.9750   NaN   0.0022
2024-02-28    3.9822    3.9702  3.9944  3.9678   NaN   0.0039
2024-02-27    3.9669    3.9717  3.9850  3.9594   NaN  -0.0004
2024-02-26    3.9686    3.9839  3.9918  3.9620   NaN  -0.0018
2024-02-23    3.9756    3.9955  4.0101  3.9755   NaN  -0.0047

In [31]:
usd_day1 = usd_pln.loc[usd_pln.index.day == 1]
usd_day1.head()

            Ostatnio  Otwarcie    Max.    Min.  Wol.  Zmiana%
Data
2024-02-01    3.9664    4.0016  4.0250  3.9653   NaN  -0.0082
2024-01-01    3.9369    3.9368  3.9416  3.9337   NaN   0.0010
2023-12-01    3.9700    4.0004  4.0119  3.9664   NaN  -0.0071
2023-11-01    4.2199    4.2116  4.2547  4.2038   NaN   0.0027
2023-09-01    4.1414    4.1262  4.1494  4.1037   NaN   0.0044

In [32]:
combined = pd.concat([combined, usd_day1['Ostatnio']], axis=1)
combined

            Unemployed        Close  Ostatnio
2011-01-01   2104986.0          NaN       NaN
2011-02-01   2150233.0  1339.599976    2.8199
2011-03-01   2133916.0  1430.699951    2.8954
2011-04-01   2043516.0  1428.099976    2.8224
2011-05-01   1962587.0          NaN       NaN
...                ...          ...       ...
2023-11-01    773403.0  1978.800049    4.2199
2023-12-01    788229.0  2071.000000    3.9700
2024-01-01    837063.0          NaN    3.9369
2024-02-01         NaN  2053.000000    3.9664
2024-03-01         NaN  2086.899902       NaN

[159 rows x 3 columns]

In [33]:
import yfinance as yf

# Pobranie danych historycznych z ostatnich 10 lat
brent_oil = yf.download("BZ=F", start='2011-01-01', end='2024-03-25')
brent_oil.head()
brent_oil.rename(columns={'Close': 'Oil (Close)'}, inplace=True)

[*********************100%%**********************]  1 of 1 completed

In [34]:
oil_day1 = brent_oil.loc[brent_oil.index.day == 1]
oil_day1.head()

,Open,High,Low,Oil (Close),Adj Close,Volume
Date,,,,,,
2011-02-01,100.489998,102.040001,100.419998,101.739998,101.739998,1352
2011-03-01,112.370003,116.699997,111.940002,115.419998,115.419998,1160
2011-04-01,117.790001,118.849998,116.839996,118.699997,118.699997,896
2011-06-01,115.970001,116.160004,114.500000,114.529999,114.529999,537
2011-07-01,110.580002,111.849998,109.940002,111.769997,111.769997,651

In [35]:
combined = pd.concat([combined, oil_day1['Oil (Close)']], axis=1)
combined

            Unemployed        Close  Ostatnio  Oil (Close)
2011-01-01   2104986.0          NaN       NaN          NaN
2011-02-01   2150233.0  1339.599976    2.8199   101.739998
2011-03-01   2133916.0  1430.699951    2.8954   115.419998
2011-04-01   2043516.0  1428.099976    2.8224   118.699997
2011-05-01   1962587.0          NaN       NaN          NaN
...                ...          ...       ...          ...
2023-11-01    773403.0  1978.800049    4.2199    84.629997
2023-12-01    788229.0  2071.000000    3.9700    78.879997
2024-01-01    837063.0          NaN    3.9369          NaN
2024-02-01         NaN  2053.000000    3.9664    78.699997
2024-03-01         NaN  2086.899902       NaN    83.550003

[159 rows x 4 columns]

In [36]:
tourists = pd.read_csv('files/tourists_mod.csv', parse_dates=['Data'], index_col='Data')
tourists.head()

            Turysci
Data
2011-01-01  1215786
2012-01-01  1360960
2013-01-01  1352509
2014-01-01  1415184
2015-01-01  1518140

In [37]:
tourists.rename(columns={'Turysci': 'Tourists'}, inplace=True)

In [38]:
combined = pd.concat([combined, tourists['Tourists']], axis=1)
combined

            Unemployed        Close  Ostatnio  Oil (Close)   Tourists
2011-01-01   2104986.0          NaN       NaN          NaN  1215786.0
2011-02-01   2150233.0  1339.599976    2.8199   101.739998  1232497.0
2011-03-01   2133916.0  1430.699951    2.8954   115.419998  1449978.0
2011-04-01   2043516.0  1428.099976    2.8224   118.699997  1510034.0
2011-05-01   1962587.0          NaN       NaN          NaN  2006688.0
...                ...          ...       ...          ...        ...
2023-11-01    773403.0  1978.800049    4.2199    84.629997  2526391.0
2023-12-01    788229.0  2071.000000    3.9700    78.879997  2472961.0
2024-01-01    837063.0          NaN    3.9369          NaN  2232273.0
2024-02-01         NaN  2053.000000    3.9664    78.699997        NaN
2024-03-01         NaN  2086.899902       NaN    83.550003        NaN

[159 rows x 5 columns]

In [39]:
cars = pd.read_csv('files/cars_mod.csv', parse_dates=['Data'], index_col='Data')
cars.head()

             Cars
Data
2011-01-01  67610
2011-02-01  67610
2011-03-01  67610
2012-01-01  77577
2012-02-01  77577

In [40]:
combined = pd.concat([combined, cars['Cars']], axis=1)
combined

,Unemployed,Close,Ostatnio,Oil (Close),Tourists,Cars
2011-01-01,2104986.0,NaN,NaN,NaN,1215786.0,67610.0
2011-02-01,2150233.0,1339.599976,2.8199,101.739998,1232497.0,67610.0
2011-03-01,2133916.0,1430.699951,2.8954,115.419998,1449978.0,67610.0
2011-04-01,2043516.0,1428.099976,2.8224,118.699997,1510034.0,69213.0
2011-05-01,1962587.0,NaN,NaN,NaN,2006688.0,69213.0
...,...,...,...,...,...,...
2023-11-01,773403.0,1978.800049,4.2199,84.629997,2526391.0,125273.0
2023-12-01,788229.0,2071.000000,3.9700,78.879997,2472961.0,125273.0
2024-01-01,837063.0,NaN,3.9369,NaN,2232273.0,NaN
2024-02-01,NaN,2053.000000,3.9664,78.699997,NaN,NaN
2024-03-01,NaN,2086.899902,NaN,83.550003,NaN,NaN

In [41]:
exp = pd.read_csv('files/import_export.csv', sep=',')
exp['date'] = pd.to_datetime(exp['date'], format='%Y-%m-%d')
exp['value'] = exp['value'].astype('float')
exp.set_index('date', inplace=True)
exp.rename({'value': 'ImportExport'}, inplace=True, axis=1)
exp.head()

            ImportExport
date
2011-01-01        108.41
2011-02-01        110.28
2011-03-01        112.79
2011-04-01        111.05
2011-05-01        106.81

In [42]:
ind_prod = pd.read_csv('files/industry_prod.csv', sep=',')
ind_prod['date'] = pd.to_datetime(ind_prod['date'], format='%Y-%m-%d')
ind_prod['value'] = ind_prod['value'].astype('float')
ind_prod.set_index('date', inplace=True)
ind_prod.rename({'value': 'IndustryProd'}, inplace=True, axis=1)
ind_prod.head()

            IndustryProd
date
2011-01-01         109.7
2011-02-01         110.5
2011-03-01         106.2
2011-04-01         106.5
2011-05-01         107.9

In [43]:
commerce = pd.read_csv('files/commerce_investments.csv', sep=',')
commerce['date'] = pd.to_datetime(commerce['date'], format='%Y-%m-%d')
commerce['value'] = commerce['value'].astype('float')
commerce.set_index('date', inplace=True)
commerce.rename({'value': 'CommerceInvest'}, inplace=True, axis=1)
commerce.head()

            CommerceInvest
date
2011-01-01            11.0
2011-02-01            13.7
2011-03-01            15.1
2011-04-01            19.3
2011-05-01            17.0

In [44]:
combined = pd.concat([combined, exp['ImportExport'], ind_prod['IndustryProd'], commerce['CommerceInvest']], axis=1)
combined

,Unemployed,Close,Ostatnio,Oil (Close),Tourists,Cars,ImportExport,IndustryProd,CommerceInvest
2011-01-01,2104986.0,NaN,NaN,NaN,1215786.0,67610.0,108.41,109.7,11.0
2011-02-01,2150233.0,1339.599976,2.8199,101.739998,1232497.0,67610.0,110.28,110.5,13.7
2011-03-01,2133916.0,1430.699951,2.8954,115.419998,1449978.0,67610.0,112.79,106.2,15.1
2011-04-01,2043516.0,1428.099976,2.8224,118.699997,1510034.0,69213.0,111.05,106.5,19.3
2011-05-01,1962587.0,NaN,NaN,NaN,2006688.0,69213.0,106.81,107.9,17.0
...,...,...,...,...,...,...,...,...,...
2023-11-01,773403.0,1978.800049,4.2199,84.629997,2526391.0,125273.0,91.56,99.7,4.9
2023-12-01,788229.0,2071.000000,3.9700,78.879997,2472961.0,125273.0,91.06,96.5,2.4
2024-01-01,837063.0,NaN,3.9369,NaN,2232273.0,NaN,NaN,NaN,NaN
2024-02-01,NaN,2053.000000,3.9664,78.699997,NaN,NaN,NaN,NaN,NaN
2024-03-01,NaN,2086.899902,NaN,83.550003,NaN,NaN,NaN,NaN,NaN

In [45]:
inflation = pd.read_csv('files/inflationmod.csv', parse_dates=['Data'], index_col='Data')
inflation.rename(columns={'Inflacja': 'Inflation'}, inplace=True)
inflation.head()

            Inflation
Data
2024-01-01        3.7
2024-02-01        2.8
2024-03-01        2.0
2023-01-01       16.6
2023-02-01       18.4

In [46]:
combined = pd.concat([combined, inflation['Inflation']], axis=1)
combined

,Unemployed,Close,Ostatnio,Oil (Close),Tourists,Cars,ImportExport,IndustryProd,CommerceInvest,Inflation
2011-01-01,2104986.0,NaN,NaN,NaN,1215786.0,67610.0,108.41,109.7,11.0,3.6
2011-02-01,2150233.0,1339.599976,2.8199,101.739998,1232497.0,67610.0,110.28,110.5,13.7,3.6
2011-03-01,2133916.0,1430.699951,2.8954,115.419998,1449978.0,67610.0,112.79,106.2,15.1,4.3
2011-04-01,2043516.0,1428.099976,2.8224,118.699997,1510034.0,69213.0,111.05,106.5,19.3,4.5
2011-05-01,1962587.0,NaN,NaN,NaN,2006688.0,69213.0,106.81,107.9,17.0,5.0
...,...,...,...,...,...,...,...,...,...,...
2023-11-01,773403.0,1978.800049,4.2199,84.629997,2526391.0,125273.0,91.56,99.7,4.9,6.6
2023-12-01,788229.0,2071.000000,3.9700,78.879997,2472961.0,125273.0,91.06,96.5,2.4,6.2
2024-01-01,837063.0,NaN,3.9369,NaN,2232273.0,NaN,NaN,NaN,NaN,3.7
2024-02-01,NaN,2053.000000,3.9664,78.699997,NaN,NaN,NaN,NaN,NaN,2.8
2024-03-01,NaN,2086.899902,NaN,83.550003,NaN,NaN,NaN,NaN,NaN,2.0

In [47]:
combined.rename(columns={'Close': 'Gold (Close)', 'Ostatnio': 'USD (Close)'}, inplace=True)

In [48]:
combined = combined.drop(['2011-01-01', '2024-02-01', '2024-03-01'])
combined

,Unemployed,Gold (Close),USD (Close),Oil (Close),Tourists,Cars,ImportExport,IndustryProd,CommerceInvest,Inflation
2011-02-01,2150233.0,1339.599976,2.8199,101.739998,1232497.0,67610.0,110.28,110.5,13.7,3.6
2011-03-01,2133916.0,1430.699951,2.8954,115.419998,1449978.0,67610.0,112.79,106.2,15.1,4.3
2011-04-01,2043516.0,1428.099976,2.8224,118.699997,1510034.0,69213.0,111.05,106.5,19.3,4.5
2011-05-01,1962587.0,NaN,NaN,NaN,2006688.0,69213.0,106.81,107.9,17.0,5.0
2011-06-01,1883299.0,1542.400024,2.7660,114.529999,2254963.0,69213.0,105.07,102.5,20.0,4.2
...,...,...,...,...,...,...,...,...,...,...
2023-09-01,775987.0,1939.800049,4.1414,88.550003,3568440.0,112282.0,92.46,96.7,4.9,8.2
2023-10-01,770446.0,NaN,NaN,NaN,2983069.0,125273.0,92.53,102.0,7.4,6.6
2023-11-01,773403.0,1978.800049,4.2199,84.629997,2526391.0,125273.0,91.56,99.7,4.9,6.6
2023-12-01,788229.0,2071.000000,3.9700,78.879997,2472961.0,125273.0,91.06,96.5,2.4,6.2
2024-01-01,837063.0,NaN,3.9369,NaN,2232273.0,NaN,NaN,NaN,NaN,3.7

In [49]:
combined.isna().sum()

Unemployed         0
Gold (Close)      54
USD (Close)       44
Oil (Close)       55
Tourists           0
Cars               1
ImportExport       1
IndustryProd       1
CommerceInvest     1
Inflation          0
dtype: int64

In [50]:
interpolated = combined.interpolate()
interpolated

,Unemployed,Gold (Close),USD (Close),Oil (Close),Tourists,Cars,ImportExport,IndustryProd,CommerceInvest,Inflation
2011-02-01,2150233.0,1339.599976,2.81990,101.739998,1232497.0,67610.0,110.28,110.5,13.7,3.6
2011-03-01,2133916.0,1430.699951,2.89540,115.419998,1449978.0,67610.0,112.79,106.2,15.1,4.3
2011-04-01,2043516.0,1428.099976,2.82240,118.699997,1510034.0,69213.0,111.05,106.5,19.3,4.5
2011-05-01,1962587.0,1485.250000,2.79420,116.614998,2006688.0,69213.0,106.81,107.9,17.0,5.0
2011-06-01,1883299.0,1542.400024,2.76600,114.529999,2254963.0,69213.0,105.07,102.5,20.0,4.2
...,...,...,...,...,...,...,...,...,...,...
2023-09-01,775987.0,1939.800049,4.14140,88.550003,3568440.0,112282.0,92.46,96.7,4.9,8.2
2023-10-01,770446.0,1959.300049,4.18065,86.590000,2983069.0,125273.0,92.53,102.0,7.4,6.6
2023-11-01,773403.0,1978.800049,4.21990,84.629997,2526391.0,125273.0,91.56,99.7,4.9,6.6
2023-12-01,788229.0,2071.000000,3.97000,78.879997,2472961.0,125273.0,91.06,96.5,2.4,6.2
2024-01-01,837063.0,2071.000000,3.93690,78.879997,2232273.0,125273.0,91.06,96.5,2.4,3.7

In [51]:
interpolated.isna().any()

Unemployed        False
Gold (Close)      False
USD (Close)       False
Oil (Close)       False
Tourists          False
Cars              False
ImportExport      False
IndustryProd      False
CommerceInvest    False
Inflation         False
dtype: bool

Save dataset to CSV

In [52]:
interpolated.to_csv('files/dataset.csv')